#+title: wxWidgets Notes
#+author: Luke Lawlor
#+email: lklawlor1@gmail.com
#+date: August 27, 2023 - August 30, 2023
** Random
#+begin_src C++ :flags $(wx-config --cppflags --libs)
	#include <iostream>

	#include <wx/wx.h>

	struct Guy{
		Guy(){ std::cout << "I am born.\n"; }
		~Guy(){ std::cout << "I am die.\n"; }
	};

	struct MainFrame : public wxFrame{
	public:
		MainFrame(const wxString &title)
			: wxFrame(nullptr, wxID_ANY, title)
		{
			auto panel = new wxPanel(this);
			auto text = new wxStaticText(panel, wxID_ANY, "Hey.", wxPoint(20, 20));
		}
	};

	struct App : public wxApp{
		bool OnInit() override
		{
			// guy is not automatically cleaned up, but other wxWidgets classes are
			auto guy = new Guy();

			auto frame = new MainFrame("C++ GUI");
			frame->SetClientSize(540, 420);
			frame->Centre();
			frame->Show();
			return true;
		}
	};

	int main()
	{
		std::cout << "once upon a time" << std::endl;
		auto app = new App;

		// Run the app
		int argc = 0;
		wxChar **argv = nullptr;
		wxApp::SetInstance(app);
		wxEntry(argc, argv);

		// Cleanup
		wxEntryCleanup();

		std::cout << "the end" << std::endl;
	}
#+end_src

#+RESULTS:
| once | upon | a     | time |
| I    | am   | born. |      |
| the  | end  |       |      |
